#+TITLE:     Kaggle Competition
#+AUTHOR:    Sergio-Feliciano Mendoza-Barrera
#+DRAWERS:    sfmb
#+EMAIL:     smendoza.barrera@gmail.com
#+DATE:     20/07/2015
#+DESCRIPTION:  The Analytics Edge Kaggle competition
#+KEYWORDS:   R, data science, emacs, ESS, org-mode, kaggle, competition
#+LANGUAGE:   en
#+OPTIONS:    H:10 num:t toc:nil \n:nil @:t ::t |:t ^:{} -:t f:t *:t <:t d:HIDDEN
#+OPTIONS:    TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS:    LaTeX:dvipng
#+INFOJS_OPT:  view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:
#+STYLE: <link rel="stylesheet" type="text/css" href="dft.css"/>

#+LaTeX_CLASS: IEEEtran
#+LATEX_CLASS_OPTIONS: [letterpaper, 9pt, onecolumn, twoside, technote, final]
#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \usepackage{makeidx}

#+LATEX_HEADER: \usepackage[lining,tabular]{fbb} % so math uses tabular lining figures
#+LATEX_HEADER: \usepackage[scaled=.95,type1]{cabin} % sans serif in style of Gill Sans
#+LATEX_HEADER: \usepackage[varqu,varl]{zi4}% inconsolata typewriter
#+LATEX_HEADER: \usepackage[T1]{fontenc} % LY1 also works
#+LATEX_HEADER: \usepackage[libertine,bigdelims]{newtxmath}
#+LATEX_HEADER: \usepackage[cal=boondoxo,bb=boondox,frak=boondox]{mathalfa}
#+LATEX_HEADER: \useosf % change normal text to use proportional oldstyle figures

#+LATEX_HEADER: \markboth{Kaggle competition, July 2015.}%
#+LATEX_HEADER: {Sergio-Feliciano Mendoza-Barrera}

#+LATEX_HEADER: \newcommand{\degC}{$^\circ$C{}}

#+STYLE: <script type="text/javascript" src="http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"> </script>

#+ATTR_HTML: width="500px"

# -*- mode: org; -*-
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
** Download the data sets

In this part we can download the data

#+BEGIN_SRC R :session :results output :exports all
  library(parallel)

  if(!file.exists("../data")) {
          dir.create("../data")
  }

  fileUrl <-
  c("https://inclass.kaggle.com/c/15-071x-the-analytics-edge-summer-2015/download/eBayiPadTest.csv",
  "https://inclass.kaggle.com/c/15-071x-the-analytics-edge-summer-2015/download/eBayiPadTrain.csv",
  "https://inclass.kaggle.com/c/15-071x-the-analytics-edge-summer-2015/download/SampleSubmission.csv")

  fileName <- c("eBayiPadTest.csv", "eBayiPadTrain.csv", "SampleSubmission.csv")

  dataPath <- "../data"

  for(i in 1:3) {
          filePath <- paste(dataPath, fileName[i], sep = "/")

          if(!file.exists(filePath)) {
                  download.file(fileUrl[i], destfile = filePath, method = "curl")
          }
  }
  list.files("../data")
#+END_SRC

#+RESULTS:
#+begin_example
 [1] "AirlinesCluster.csv"     "AnonymityPoll.csv"
 [3] "baseball.csv"            "BoeingStock.csv"
 [5] "boston.csv"              "ClaimsData.csv"
 [7] "ClaimsData.csv.zip"      "climate_change.csv"
 [9] "clinical_trial.csv"      "ClusterMeans.ods"
[11] "CocaColaStock.csv"       "CountryCodes.csv"
[13] "CPSData.csv"             "dailykos.csv"
[15] "eBayiPadTest.csv"        "eBayiPadTrain.csv"
[17] "emails.csv"              "energy_bids.csv"
[19] "flower.csv"              "FluTest.csv"
[21] "FluTrain.csv"            "framingham.csv"
[23] "gerber.csv"              "GEStock.csv"
[25] "healthy.csv"             "IBMStock.csv"
[27] "loans_imputed.csv"       "loans.csv"
[29] "MetroAreaCodes.csv"      "movieLens.txt"
[31] "mvtWeek1.csv"            "NBA_test.csv"
[33] "NBA_train.csv"           "parole.csv"
[35] "pisa2009test.csv"        "pisa2009train.csv"
[37] "PollingData_Imputed.csv" "PollingData.csv"
[39] "ProcterGambleStock.csv"  "quality.csv"
[41] "README.md"               "SampleSubmission.csv"
[43] "songs.csv"               "stevens.csv"
[45] "StocksCluster.csv"       "stopwords.txt"
[47] "tumor.csv"               "tweets.csv"
[49] "USDA.csv"                "WHO_Europe.csv"
[51] "WHO.csv"                 "wiki.csv"
[53] "wine_test.csv"           "wine.csv"
#+end_example

** Load the data set

#+BEGIN_SRC R :session :results output :exports all
  writeLines("    Loading data set into their data frame...")
  ## eBayiPadTrain <- read.table("../data/eBayiPadTrain.csv", sep = ",", header = TRUE)
  eBayiPadTrain <- read.csv("../data/eBayiPadTrain.csv", colClasses = "character",
                   na.strings = c("", "Unknown", NULL))

  str(eBayiPadTrain)
#+END_SRC

#+RESULTS:
#+begin_example
    Loading data set into their data frame...
'data.frame':	1861 obs. of  11 variables:
 $ description: chr  "iPad is in 8.5+ out of 10 cosmetic condition!" "Previously used, please read description. May show signs of use such as scratches to the screen and " NA NA ...
 $ biddable   : chr  "0" "1" "0" "0" ...
 $ startprice : chr  "159.99" "0.99" "199.99" "235" ...
 $ condition  : chr  "Used" "Used" "Used" "New other (see details)" ...
 $ cellular   : chr  "0" "1" "0" "0" ...
 $ carrier    : chr  "None" "Verizon" "None" "None" ...
 $ color      : chr  "Black" NA "White" NA ...
 $ storage    : chr  "16" "16" "16" "16" ...
 $ productline: chr  "iPad 2" "iPad 2" "iPad 4" "iPad mini 2" ...
 $ sold       : chr  "0" "1" "1" "0" ...
 $ UniqueID   : chr  "10001" "10002" "10003" "10004" ...
#+end_example

** Exploratory data analysis

#+begin_src R :session :results output :exports all
  writeLines("\n :: Summary of the data:")
  str(eBayiPadTrain)
  summary(eBayiPadTrain)
#+end_src

#+RESULTS:
#+begin_example

 :: Summary of the data:
'data.frame':	1861 obs. of  11 variables:
 $ description: chr  "iPad is in 8.5+ out of 10 cosmetic condition!" "Previously used, please read description. May show signs of use such as scratches to the screen and " NA NA ...
 $ biddable   : int  0 1 0 0 0 1 1 0 1 1 ...
 $ startprice : num  159.99 0.99 199.99 235 199.99 ...
 $ condition  : chr  "Used" "Used" "Used" "New other (see details)" ...
 $ cellular   : int  0 1 0 0 NA 1 0 0 1 0 ...
 $ carrier    : chr  "None" "Verizon" "None" "None" ...
 $ color      : chr  "Black" NA "White" NA ...
 $ storage    : int  16 16 16 16 NA 32 16 16 64 32 ...
 $ productline: chr  "iPad 2" "iPad 2" "iPad 4" "iPad mini 2" ...
 $ sold       : int  0 1 1 0 0 1 1 0 1 1 ...
 $ UniqueID   : chr  "10001" "10002" "10003" "10004" ...
 description           biddable        startprice      condition
 Length:1861        Min.   :0.0000   Min.   :  0.01   Length:1861
 Class :character   1st Qu.:0.0000   1st Qu.: 80.00   Class :character
 Mode  :character   Median :0.0000   Median :179.99   Mode  :character
                    Mean   :0.4498   Mean   :211.18
                    3rd Qu.:1.0000   3rd Qu.:300.00
                    Max.   :1.0000   Max.   :999.00

    cellular        carrier             color              storage
 Min.   :0.0000   Length:1861        Length:1861        Min.   : 16.00
 1st Qu.:0.0000   Class :character   Class :character   1st Qu.: 16.00
 Median :0.0000   Mode  :character   Mode  :character   Median : 16.00
 Mean   :0.3196                                         Mean   : 34.23
 3rd Qu.:1.0000                                         3rd Qu.: 32.00
 Max.   :1.0000                                         Max.   :128.00
 NA's   :234                                            NA's   :183
 productline             sold          UniqueID
 Length:1861        Min.   :0.0000   Length:1861
 Class :character   1st Qu.:0.0000   Class :character
 Mode  :character   Median :0.0000   Mode  :character
                    Mean   :0.4621
                    3rd Qu.:1.0000
                    Max.   :1.0000
#+end_example
